nc: 4
depth_multiple: 1.0
width_multiple: 1.0
mobilevit_backbone: True

anchors:
  - [10,13, 16,30, 33,23]   # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# ============================================================
# Backbone — identical to baseline (InvertedResidual + MobileViTBlockv2)
# We do NOT touch the backbone to isolate neck changes cleanly
# ============================================================
backbone:
  [[-1, 1, Conv, [16, 3, 2, None, 1]],              # 0-P1/2
   [-1, 1, InvertedResidual, [32, 1, 2]],            # 1

   [-1, 1, InvertedResidual, [48, 2, 2]],            # 2-P2/4
   [-1, 2, InvertedResidual, [48, 1, 2]],            # 3

   [-1, 1, InvertedResidual, [64, 2, 2]],            # 4
   [-1, 1, MobileViTBlockv2, [64, 96, 2, 2, 0.0, 0.0, 0.0, 2, 2, 3, 1]],  # 5 P3/8

   [-1, 1, InvertedResidual, [80, 2, 2]],            # 6
   [-1, 1, MobileViTBlockv2, [80, 120, 2, 4, 0.0, 0.0, 0.0, 2, 2, 3, 1]], # 7 P4/16

   [-1, 1, InvertedResidual, [96, 2, 2]],            # 8
   [-1, 1, MobileViTBlockv2, [96, 144, 2, 2, 0.0, 0.0, 0.0, 2, 2, 3, 1]], # 9 P5/32
  ]


head:
  [[-1, 1, Conv, [256, 1, 1, None, 1]],             # 10  compress to 256ch
   [-2, 1, Conv, [256, 1, 1, None, 1]],             # 11  second branch
   [-1, 1, SPPF, [256]],                            # 12  [C2] replaces SP×3+Concat+Conv
   [[-1, -2], 1, Concat, [1]],                      # 13  concat both branches
   [-1, 1, Conv, [256, 1, 1, None, 1]],             # 14  neck output (≈ layer 18 in baseline)

   # ── Top-down: P5→P4 ───────────────────────────────────────────────────────
   [-1, 1, DeformConv2dPack, [128, 3, 1, 1, 1]],   # 15  DU deformable conv (unchanged)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],      # 16  upsample ×2
   [7, 1, Conv, [128, 1, 1, None, 1]],              # 17  lateral from backbone P4
   [[-1, -2], 1, Concat, [1]],                      # 18  fuse

   # [C3] GhostMultiConcat replaces the 4-conv dense Multi-Concat block
   [-1, 1, Conv, [64, 1, 1, None, 1]],              # 19
   [-2, 1, Conv, [64, 1, 1, None, 1]],              # 20
   [-1, 1, GhostConv, [64, 3, 1]],                  # 21  [C3] ghost conv replaces Conv
   [-1, 1, GhostConv, [64, 3, 1]],                  # 22  [C3] ghost conv replaces Conv
   [[-1, -2, -3, -4], 1, Concat, [1]],              # 23
   [-1, 1, Conv, [128, 1, 1, None, 1]],             # 24  P4 feature (≈ layer 28 baseline)

   # ── Top-down: P4→P3 ───────────────────────────────────────────────────────
   [-1, 1, DeformConv2dPack, [64, 3, 1, 1, 1]],    # 25  DU (unchanged)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],      # 26  upsample ×2
   [5, 1, Conv, [64, 1, 1, None, 1]],               # 27  lateral from backbone P3
   [[-1, -2], 1, Concat, [1]],                      # 28  fuse

   # [C3] GhostMultiConcat at P3
   [-1, 1, Conv, [32, 1, 1, None, 1]],              # 29
   [-2, 1, Conv, [32, 1, 1, None, 1]],              # 30
   [-1, 1, GhostConv, [32, 3, 1]],                  # 31  [C3]
   [-1, 1, GhostConv, [32, 3, 1]],                  # 32  [C3]
   [[-1, -2, -3, -4], 1, Concat, [1]],              # 33
   [-1, 1, Conv, [64, 1, 1, None, 1]],              # 34  P3 output (≈ layer 38 baseline)

   # ── Bottom-up: P3→P4 ──────────────────────────────────────────────────────
   [-1, 1, Conv, [128, 3, 2, None, 1]],             # 35  downsample
   [[-1, 24], 1, Concat, [1]],                      # 36  fuse with P4

   # [C3] GhostMultiConcat
   [-1, 1, Conv, [64, 1, 1, None, 1]],              # 37
   [-2, 1, Conv, [64, 1, 1, None, 1]],              # 38
   [-1, 1, GhostConv, [64, 3, 1]],                  # 39  [C3]
   [-1, 1, GhostConv, [64, 3, 1]],                  # 40  [C3]
   [[-1, -2, -3, -4], 1, Concat, [1]],              # 41
   [-1, 1, Conv, [128, 1, 1, None, 1]],             # 42  P4 output (≈ layer 46 baseline)

   # ── Bottom-up: P4→P5 ──────────────────────────────────────────────────────
   [-1, 1, Conv, [256, 3, 2, None, 1]],             # 43  downsample
   [[-1, 14], 1, Concat, [1]],                      # 44  fuse with neck bottleneck

   # [C3] GhostMultiConcat
   [-1, 1, Conv, [128, 1, 1, None, 1]],             # 45
   [-2, 1, Conv, [128, 1, 1, None, 1]],             # 46
   [-1, 1, GhostConv, [128, 3, 1]],                 # 47  [C3]
   [-1, 1, GhostConv, [128, 3, 1]],                 # 48  [C3]
   [[-1, -2, -3, -4], 1, Concat, [1]],              # 49
   [-1, 1, Conv, [256, 1, 1, None, 1]],             # 50  P5 output (≈ layer 54 baseline)

   # ── Detection heads — identical to baseline ───────────────────────────────
   [34, 1, Conv, [128, 3, 1, None, 1]],             # 51  P3 head conv
   [42, 1, Conv, [256, 3, 1, None, 1]],             # 52  P4 head conv
   [50, 1, Conv, [512, 3, 1, None, 1]],             # 53  P5 head conv

   [[51, 52, 53], 1, IDetect, [nc, anchors]],       # 54  Detect(P3, P4, P5)
  ]